tap "anomalyco/tap"
tap "antoniorodr/memo"
tap "can1357/tap"
tap "jwoo0122/tap", trusted: true
tap "openclaw/tap"
tap "steipete/tap"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Browser automation CLI for AI agents
brew "agent-browser"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Tool for building final distributable artifacts and uploading them to an archive
brew "cargo-dist"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Self-improving AI agent that creates skills from experience
brew "hermes-agent"
# Linux virtual machines
brew "lima"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# AI agent toolkit
brew "pi-coding-agent"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Manage Git worktrees and attachable agent sessions
brew "jwoo0122/tap/david", trusted: true
# A small local JSONL agent harness
brew "jwoo0122/tap/lucy", trusted: true
# Manage Git worktrees and attachable agent sessions
brew "jwoo0122/tap/tony"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Minimal installer for conda
cask "miniconda"
cargo "wasm-bindgen-cli"
npm "@jwoo0122/harness"
npm "clawhub"
npm "corepack"
npm "openclaw"
