tap "antoniorodr/memo"
tap "steipete/tap"
brew "agent-browser"
brew "chezmoi"
brew "flyctl"
brew "gh"
brew "lazygit"
brew "mise"
brew "mole"
brew "neovim"
brew "tree-sitter-cli"
brew "websocat"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "antoniorodr/memo/memo"
brew "steipete/tap/goplaces"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
cask "claude-code"
cask "codex"
cask "ghostty"
cask "godot"
cask "ngrok"
go "cmd/go"
go "cmd/gofmt"
go "github.com/bluesky-social/indigo/cmd/tap"
