tap "anomalyco/tap"
tap "antoniorodr/memo"
tap "openclaw/tap"
tap "steipete/tap"
brew "agent-browser"
brew "chezmoi"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "lazygit"
brew "mise"
brew "mole"
brew "neovim"
brew "summarize"
brew "tmux"
brew "tree-sitter-cli"
brew "websocat"
brew "yq"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "antoniorodr/memo/memo"
brew "openclaw/tap/goplaces"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
cask "codex"
cask "ghostty"
cask "godot"
cask "ngrok"
go "cmd/go"
go "cmd/gofmt"
go "github.com/bluesky-social/indigo/cmd/tap"
cargo "wasm-bindgen-cli"
npm "@google/gemini-cli"
npm "@mariozechner/pi-coding-agent"
npm "dmux"
npm "openclaw"
npm "vercel"
